Picovoice/porcupine/demo/mcu/stm32h747/stm32h747i-disco/CM7/Drivers/BSP/Components/wm8994/wm8994_reg.h
/*******************************************************************************
* Register      : WM8994_SPKMIXR_ATT
* Address       : 0X23
* Bit Group Name: MIXOUTR_SPKMIXR_VOL
* Permission    : RW
*******************************************************************************/
#define   WM8994_SPKMIXR_ATT_MIXOUTL_VOL_MASK          (uint16_t)0x0008
#define   WM8994_SPKMIXR_ATT_MIXOUTL_VOL_POSITION      3
int32_t   wm8994_spkmixr_att_mixoutl_vol(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_SPKMIXR_ATT
* Address       : 0X23
* Bit Group Name: IN1RP_SPKMIXR_VOL
* Permission    : RW
*******************************************************************************/
#define   WM8994_SPKMIXR_ATT_IN1RP_VOL_MASK          (uint16_t)0x0010
#define   WM8994_SPKMIXR_ATT_IN1RP_VOL_POSITION      4
int32_t   wm8994_spkmixr_att_in1rp_vol(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_SPKMIXR_ATT
* Address       : 0X23
* Bit Group Name: MIXINL_SPKMIXR_VOL
* Permission    : RW
*******************************************************************************/
#define   WM8994_SPKMIXR_ATT_MIXINL_VOL_MASK          (uint16_t)0x0020
#define   WM8994_SPKMIXR_ATT_MIXINL_VOL_POSITION      5
int32_t   wm8994_spkmixr_att_mixinl_vol(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_SPKMIXR_ATT
* Address       : 0X23
* Bit Group Name: DAC2R_SPKMIXR_VOL
* Permission    : RW
*******************************************************************************/
#define   WM8994_SPKMIXR_ATT_DAC2R_VOL_MASK          (uint16_t)0x0040
#define   WM8994_SPKMIXR_ATT_DAC2R_VOL_POSITION      6
int32_t   wm8994_spkmixr_att_dac2r_vol(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_SPKMIXR_ATT
* Address       : 0X23
* Bit Group Name: SPKOUT_CLASSAB
* Permission    : RW
*******************************************************************************/
#define   WM8994_SPKMIXR_ATT_SPKOUT_CLASSAB_MASK          (uint16_t)0x0100
#define   WM8994_SPKMIXR_ATT_SPKOUT_CLASSAB_POSITION      8
int32_t   wm8994_spkmixr_att_spkout_classab(wm8994_ctx_t *ctx, uint16_t value);

/* Note: Registers (uint16_t)0x24 and (uint16_t)0x25 are not implemented here */

/*******************************************************************************
* Register      : WM8994_SPK_LEFT_VOL
* Address       : 0X26
* Bit Group Name: SPKOUTL_VOL [5:0]
* Permission    : RW
*******************************************************************************/
#define   WM8994_SPK_LEFT_VOL_SPKOUT_VOL_MASK          (uint16_t)0x003F
#define   WM8994_SPK_LEFT_VOL_SPKOUT_VOL_POSITION      5
int32_t   wm8994_spk_left_vol_spkout_vol(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_SPK_LEFT_VOL
* Address       : 0X26
* Bit Group Name: SPKOUTL_MUTE_N
* Permission    : RW
*******************************************************************************/
#define   WM8994_SPK_LEFT_VOL_SPKOUT_MUTE_N_MASK          (uint16_t)0x0040
#define   WM8994_SPK_LEFT_VOL_SPKOUT_MUTE_N_POSITION      6
int32_t   wm8994_spk_left_vol_spkout_mute_n(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_SPK_LEFT_VOL
* Address       : 0X26
* Bit Group Name: SPKOUTL_ZC
* Permission    : RW
*******************************************************************************/
#define   WM8994_SPK_LEFT_VOL_SPKOUT_ZC_MASK          (uint16_t)0x0080
#define   WM8994_SPK_LEFT_VOL_SPKOUT_ZC_POSITION      7
int32_t   wm8994_spk_left_vol_spkout_zc(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_SPK_LEFT_VOL
* Address       : 0X26
* Bit Group Name: SPKOUT_VU
* Permission    : RW
*******************************************************************************/
#define   WM8994_SPK_LEFT_VOL_SPKOUT_VU_MASK          (uint16_t)0x0100
#define   WM8994_SPK_LEFT_VOL_SPKOUT_VU_POSITION      8
int32_t   wm8994_spk_left_vol_spkout_vu(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_SPK_RIGHT_VOL
* Address       : 0X27
* Bit Group Name: SPKOUTR_VOL [5:0]
* Permission    : RW
*******************************************************************************/
#define   WM8994_SPK_RIGHT_VOL_SPKOUT_VOL_MASK          (uint16_t)0x003F
#define   WM8994_SPK_RIGHT_VOL_SPKOUT_VOL_POSITION      5
int32_t   wm8994_spk_right_vol_spkout_vol(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_SPK_RIGHT_VOL
* Address       : 0X27
* Bit Group Name: SPKOUTR_MUTE_N
* Permission    : RW
*******************************************************************************/
#define   WM8994_SPK_RIGHT_VOL_SPKOUT_MUTE_N_MASK          (uint16_t)0x0040
#define   WM8994_SPK_RIGHT_VOL_SPKOUT_MUTE_N_POSITION      6
int32_t   wm8994_spk_right_vol_spkout_mute_n(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_SPK_RIGHT_VOL
* Address       : 0X27
* Bit Group Name: SPKOUTR_ZC
* Permission    : RW
*******************************************************************************/
#define   WM8994_SPK_RIGHT_VOL_SPKOUT_ZC_MASK          (uint16_t)0x0080
#define   WM8994_SPK_RIGHT_VOL_SPKOUT_ZC_POSITION      7
int32_t   wm8994_spk_right_vol_spkout_zc(wm8994_ctx_t *ctx, uint16_t value);

