Picovoice/porcupine/demo/mcu/stm32h747/stm32h747i-disco/CM7/Drivers/BSP/Components/wm8994/wm8994_reg.h
/*******************************************************************************
* Register      : WM8994_AIF1_CONTROL1
* Address       : 0X300
* Bit Group Name: AIF1_BCLK_INV
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1_CONTROL1_BCLK_INV_MASK                 (uint16_t)0x0100
#define   WM8994_AIF1_CONTROL1_BCLK_INV_POSITION             8
int32_t   wm8994_aif1_control1_bclk_inv(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_CONTROL1
* Address       : 0X300
* Bit Group Name: AIF1ADC_TDM
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1_CONTROL1_ADC_TDM_MASK                 (uint16_t)0x2000
#define   WM8994_AIF1_CONTROL1_ADC_TDM_POSITION             13
int32_t   wm8994_aif1_control1_adc_tdm(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_CONTROL1
* Address       : 0X300
* Bit Group Name: AIF1ADCR_SRC
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1_CONTROL1_ADCR_SRC_MASK                 (uint16_t)0x4000
#define   WM8994_AIF1_CONTROL1_ADCR_SRC_POSITION             14
int32_t   wm8994_aif1_control1_adcr_src(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_CONTROL1
* Address       : 0X300
* Bit Group Name: AIF1ADCL_SRC
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1_CONTROL1_ADCL_SRC_MASK                 (uint16_t)0x8000
#define   WM8994_AIF1_CONTROL1_ADCL_SRC_POSITION             15
int32_t   wm8994_aif1_control1_adcl_src(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_MASTER_SLAVE
* Address       : 0X302
* Bit Group Name: AIF1_LRCLK_FRC
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1_MS_LRCLK_FRC_MASK                 (uint16_t)0x1000
#define   WM8994_AIF1_MS_LRCLK_FRC_POSITION             12
int32_t   wm8994_aif1_ms_lrclk_frc(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_MASTER_SLAVE
* Address       : 0X302
* Bit Group Name: AIF1_CLK_FRC
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1_MS_CLK_FRC_MASK                 (uint16_t)0x2000
#define   WM8994_AIF1_MS_CLK_FRC_POSITION             13
int32_t   wm8994_aif1_ms_clk_frc(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_MASTER_SLAVE
* Address       : 0X302
* Bit Group Name: AIF1_MSTR
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1_MS_MSTR_MASK                 (uint16_t)0x4000
#define   WM8994_AIF1_MS_MSTR_POSITION             14
int32_t   wm8994_aif1_ms_mstr(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_MASTER_SLAVE
* Address       : 0X302
* Bit Group Name: AIF1_TRI
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1_MS_TRI_MASK                 (uint16_t)0x8000
#define   WM8994_AIF1_MS_TRI_POSITION             15
int32_t   wm8994_aif1_ms_tri(wm8994_ctx_t *ctx, uint16_t value);

/* Note: Registers (uint16_t)0x301, (uint16_t)0x303, (uint16_t)0x304, (uint16_t)0x305, (uint16_t)0x306, (uint16_t)0x307, (uint16_t)0x310, (uint16_t)0x311,
         (uint16_t)0x312, (uint16_t)0x313, (uint16_t)0x314, (uint16_t)0x315, (uint16_t)0x316 and (uint16_t)0x317  are not implemented here */

/*******************************************************************************
* Register      : WM8994_AIF1_ADC1_LEFT_VOL
* Address       : 0X400
* Bit Group Name: AIF1ADC1L_VOL [7:0]
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1_ADC1_LEFT_VOL_ADC1L_MASK                 (uint16_t)0x00FF
#define   WM8994_AIF1_ADC1_LEFT_VOL_ADC1L_POSITION             0
int32_t   wm8994_aif1_adc1_left_vol_adc1l(wm8994_ctx_t *ctx, uint16_t value);
int32_t   wm8994_aif1_adc1_left_vol_adc1l_r(wm8994_ctx_t *ctx, uint16_t *value);

/*******************************************************************************
* Register      : WM8994_AIF1_ADC1_LEFT_VOL
* Address       : 0X400
* Bit Group Name: AIF1ADC1L_VU
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1_ADC1_LEFT_VOL_VU_MASK                 (uint16_t)0x0100
#define   WM8994_AIF1_ADC1_LEFT_VOL_VU_POSITION             8
int32_t   wm8994_aif1_adc1_left_vol_vu(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_ADC1_RIGHT_VOL
* Address       : 0X401
* Bit Group Name: AIF1ADC1R_VOL [7:0]
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1_ADC1_RIGHT_VOL_ADC1R_MASK                 (uint16_t)0x00FF
#define   WM8994_AIF1_ADC1_RIGHT_VOL_ADC1R_POSITION             0
int32_t   wm8994_aif1_adc1_right_vol_adc1r(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_ADC1_RIGHT_VOL
* Address       : 0X401
* Bit Group Name: AIF1ADC1R_VU
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1_ADC1_RIGHT_VOL_VU_MASK                 (uint16_t)0x0100
#define   WM8994_AIF1_ADC1_RIGHT_VOL_VU_POSITION             8
int32_t   wm8994_aif1_adc1_right_vol_vu(wm8994_ctx_t *ctx, uint16_t value);

