Picovoice/porcupine/demo/mcu/stm32h747/stm32h747i-disco/CM7/Drivers/BSP/Components/wm8994/wm8994_reg.h
/*******************************************************************************
* Register      : WM8994_AIF1_ADC2_RMR
* Address       : 0X609
* Bit Group Name: AIF2DACL_TO_AIF1ADC2R
* Permission    : RW
*******************************************************************************/
#define   WM8994_ADC2RMR_AIF2DACL_TO_AIF1ADC2R_MASK                 (uint16_t)0x0001
#define   WM8994_ADC2RMR_AIF2DACL_TO_AIF1ADC2R_POSITION             0
int32_t   wm8994_adc2rmr_aif2dacl_to_aif1adc2r(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_ADC2_RMR
* Address       : 0X609
* Bit Group Name: ADC2R_TO_AIF1ADC2R
* Permission    : RW
*******************************************************************************/
#define   WM8994_ADC2RMR_ADC2R_TO_AIF1ADC2R_MASK                 (uint16_t)0x0002
#define   WM8994_ADC2RMR_ADC2R_TO_AIF1ADC2R_POSITION             1
int32_t   wm8994_adc2rmr_adc2r_to_aif1adc2r(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_DAC1_LEFT_VOL
* Address       : 0X610
* Bit Group Name: DAC1L_VOL[7:0]
* Permission    : RW
*******************************************************************************/
#define   WM8994_DAC1_LEFT_VOL_VSET_MASK                 (uint16_t)0x00FF
#define   WM8994_DAC1_LEFT_VOL_VSET_POSITION             0
int32_t   wm8994_dac1_left_vol_vset(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_DAC1_LEFT_VOL
* Address       : 0X610
* Bit Group Name: DAC1L_VU
* Permission    : RW
*******************************************************************************/
#define   WM8994_DAC1_LEFT_VOL_VU_MASK                 (uint16_t)0x0100
#define   WM8994_DAC1_LEFT_VOL_VU_POSITION             8
int32_t   wm8994_dac1_left_vol_vu(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_DAC1_LEFT_VOL
* Address       : 0X610
* Bit Group Name: DAC1L_MUTE
* Permission    : RW
*******************************************************************************/
#define   WM8994_DAC1_LEFT_VOL_MUTE_MASK                 (uint16_t)0x0200
#define   WM8994_DAC1_LEFT_VOL_MUTE_POSITION             9
int32_t   wm8994_dac1_left_vol_mute(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_DAC1_RIGHT_VOL
* Address       : 0X611
* Bit Group Name: DAC1R_VOL[7:0]
* Permission    : RW
*******************************************************************************/
#define   WM8994_DAC1_RIGHT_VOL_VSET_MASK                 (uint16_t)0x00FF
#define   WM8994_DAC1_RIGHT_VOL_VSET_POSITION             0
int32_t   wm8994_dac1_right_vol_vset(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_DAC1_RIGHT_VOL
* Address       : 0X611
* Bit Group Name: DAC1R_VU
* Permission    : RW
*******************************************************************************/
#define   WM8994_DAC1_RIGHT_VOL_VU_MASK                 (uint16_t)0x0100
#define   WM8994_DAC1_RIGHT_VOL_VU_POSITION             8
int32_t   wm8994_dac1_right_vol_vu(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_DAC1_RIGHT_VOL
* Address       : 0X611
* Bit Group Name: DAC1R_MUTE
* Permission    : RW
*******************************************************************************/
#define   WM8994_DAC1_RIGHT_VOL_MUTE_MASK                 (uint16_t)0x0200
#define   WM8994_DAC1_RIGHT_VOL_MUTE_POSITION             9
int32_t   wm8994_dac1_right_vol_mute(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_DAC2_LEFT_VOL
* Address       : 0X612
* Bit Group Name: DAC2L_VOL[7:0]
* Permission    : RW
*******************************************************************************/
#define   WM8994_DAC2_LEFT_VOL_VSET_MASK                 (uint16_t)0x00FF
#define   WM8994_DAC2_LEFT_VOL_VSET_POSITION             0
int32_t   wm8994_dac2_left_vol_vset(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_DAC2_LEFT_VOL
* Address       : 0X612
* Bit Group Name: DAC2L_VU
* Permission    : RW
*******************************************************************************/
#define   WM8994_DAC2_LEFT_VOL_VU_MASK                 (uint16_t)0x0100
#define   WM8994_DAC2_LEFT_VOL_VU_POSITION             8
int32_t   wm8994_dac2_left_vol_vu(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_DAC2_LEFT_VOL
* Address       : 0X612
* Bit Group Name: DAC2L_MUTE
* Permission    : RW
*******************************************************************************/
#define   WM8994_DAC2_LEFT_VOL_MUTE_MASK                 (uint16_t)0x0200
#define   WM8994_DAC2_LEFT_VOL_MUTE_POSITION             9
int32_t   wm8994_dac2_left_vol_mute(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_DAC2_RIGHT_VOL
* Address       : 0X613
* Bit Group Name: DAC2R_VOL[7:0]
* Permission    : RW
*******************************************************************************/
#define   WM8994_DAC2_RIGHT_VOL_VSET_MASK                 (uint16_t)0x00FF
#define   WM8994_DAC2_RIGHT_VOL_VSET_POSITION             0
int32_t   wm8994_dac2_right_vol_vset(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_DAC2_RIGHT_VOL
* Address       : 0X613
* Bit Group Name: DAC2R_VU
* Permission    : RW
*******************************************************************************/
#define   WM8994_DAC2_RIGHT_VOL_VU_MASK                 (uint16_t)0x0100
#define   WM8994_DAC2_RIGHT_VOL_VU_POSITION             8
int32_t   wm8994_dac2_right_vol_vu(wm8994_ctx_t *ctx, uint16_t value);

